In [1]:
import pandas as pd

In [2]:
a = [4, 8, 15, 16, 23,42]

In [5]:
df = pd.Series(a)

In [6]:
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
b = [ 1,2,3,4,5,6,7,8,9,10]

In [8]:
 type(b)

list

In [10]:
dt = pd.Series(b)
print (dt)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [15]:
import pandas as pd 
data = {
    "Name" : ["Alice","Bob","Claire"],
    "Age" : ["25","30","27"],
    "Gender" : ["Female","Male","Female"]
}

In [16]:
dg = pd.DataFrame(data)
print(dg)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [17]:
#SERIES VS DATAFRAME 
#A Pandas Series is a one-dimensional labeled array,
#while a DataFrame is a two-dimensional tabular data structure with labeled axes (rows and columns)

In [18]:
dg.head()

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [19]:
dg.tail()

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [20]:
dg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      object
 2   Gender  3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [21]:
dg.describe()

         Name Age  Gender
count       3   3       3
unique      3   3       2
top     Alice  25  Female
freq        1   1       2

In [27]:
dg.sort_values(by Age,ascending = False)

SyntaxError: invalid syntax (1534553125.py, line 1)

In [28]:
dg.sort_values(by='Age', ascending=False, inplace=True)

In [29]:
print(dg)

     Name Age  Gender
1     Bob  30    Male
2  Claire  27  Female
0   Alice  25  Female

In [30]:
#Mutable: Series, DataFrame
#Not Mutable (removed): Panel

In [32]:
a = [1,2,3]
b = ["anu","dhruvi","gnan"]
c = [22,33,77]
dh = {
   " roll" : a,
   " name" : b,
   " age" : c
}
pd.DataFrame(dh)

    roll    name   age
0      1     anu    22
1      2  dhruvi    33
2      3    gnan    77